jimliu3/stm8/main.c
/* MAIN.C file
 * 
 * Copyright (c) 2002-2005 STMicroelectronics
 */
#include "stm8s.h"
#include "stm8s_conf.h"
#include "uart.h"
#include "rc522.h"
#include "lf_send.h"
#include <string.h>
#include <stdlib.h>

#define TEST_MODE_RFID   0      //  RFID test mode
#define TEST_MODE_LF     1      //  LF (125kHz / 433MHz) test mode
#define TEST_MODE_RF433  1      //  433M test mode


unsigned char RFFull = 0;
unsigned char RFBit;
unsigned char LL_w = 0;
unsigned char First_flag = 0;
unsigned char Buff_B[8];
unsigned char RF_UartSend[10];
unsigned char secure_key[10];
u8 RF_set=0;
unsigned char BitCount;
unsigned char Time_1ms = 0;

/* Key cache in RAM (loaded from EEPROM before halt) */
uint8_t cached_key_count = 0;
uint8_t cached_keys[5][16];  // 5 x 16 bytes

#define RF_LEN       64
const uint8_t Secret_Key[8] = {0x12, 0x34, 0x56, 0x78, 0x9A, 0xBC, 0xDE, 0xF0};


void RF_Remote(uint8_t);

enum pke_oper_state {
    PKE_OPER_STA_POWER_OFF,
    PKE_OPER_STA_POWER_ON,
    PKE_OPER_STA_WAIT,
    PKE_OPER_STA_IDLE,
    PKE_OPER_STA_LEARN,
    PKE_OPER_STA_BUSY,
    PKE_OPER_STA_ERROR
};

volatile struct PKE_config {
    uint8_t key_num;
    uint8_t rc522_num;
    volatile uint8_t oper_state;
    volatile uint8_t power_event_flag;
    volatile uint8_t learn_event_flag;
} TJTW_PKE;

#define BR_LIGHT_ON()      GPIO_WriteHigh(GPIOD, GPIO_PIN_3)
#define BR_LIGHT_OFF()     GPIO_WriteLow(GPIOD, GPIO_PIN_3)

#define BZ_ON()      GPIO_WriteHigh(GPIOB, GPIO_PIN_1)
#define BZ_OFF()     GPIO_WriteLow(GPIOB, GPIO_PIN_1)

#define LP_RIGHT_ON()      GPIO_WriteHigh(GPIOB, GPIO_PIN_3)
#define LP_RIGHT_OFF()     GPIO_WriteLow(GPIOB, GPIO_PIN_3)

#define MOTOR2_ON()     GPIO_WriteHigh(GPIOC, GPIO_PIN_2)
#define MOTOR2_OFF()    GPIO_WriteLow(GPIOC, GPIO_PIN_2)

#define MOTOR1_ON()     GPIO_WriteHigh(GPIOB, GPIO_PIN_0)
#define MOTOR1_OFF()    GPIO_WriteLow(GPIOB, GPIO_PIN_0)

#define MOTOR_FWD()  do{MOTOR1_ON(); MOTOR2_OFF();}while(0)
#define MOTOR_REV()  do{MOTOR1_OFF(); MOTOR2_ON();}while(0)
#define MOTOR_STOP() do{MOTOR1_OFF(); MOTOR2_OFF();}while(0)

#define RF_DATA_LOW()        (GPIO_ReadInputPin(GPIOD, GPIO_PIN_0) == RESET)   //RESET=0

#define KEY_BLOCK_SIZE       16    // 4 (RFID) + 8 (full Buff_B, include CRC) + 2 (wake up)
#define MAX_KEY_NUM          5
#define KEY_DATA_START_ADDR  0x00004110
#define KEY_COUNT_ADDR       0x00004100

//for ign to count down by 10s
#define IGN_TIMEOUT_MS      10000UL
#define IGN_TIMEOUT_S       (IGN_TIMEOUT_MS / 1000UL)
#define IGN_IS_ON()         (GPIO_ReadInputPin(GPIOB, GPIO_PIN_5) != RESET)  //SET=1
#define IGN_detect()         GPIO_ReadInputPin(GPIOB, GPIO_PIN_5)

#define MCU_REG_NUM      26
const uint8_t mcu_user_config[MCU_REG_NUM] =
{
    0xA5,0x5A,0x01,0x7D,0x80,0x00,0x00,0x01,
    0xC3,0x3A,0x0C,0x01,0x00,0x15,0x00,0x01,
    0x01,0x81,0x32,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,
};


u8 Tx_Buffer[] = "RFID---test";

#define  BufferSize (countof(Tx_Buffer)-1)

uint16_t Calculate_CRC16(uint8_t *ptr, uint8_t len, uint8_t ran) {
    uint16_t crc = 0xFFFF;
    uint8_t i, j;
    if (ran == 1)
        crc = 0xFFFF;
    else if (ran == 2)
        crc = 0x1234;

    for (i = 0; i < len; i++) {
        crc ^= (uint16_t)ptr[i] << 8;
        for (j = 0; j < 8; j++) {
            if (crc & 0x8000) {
                crc = (crc << 1) ^ 0x1021;
            } else {
                crc <<= 1;
            }
        }
    }
    return crc;
}

uint16_t Generate_Wakeup_Code(uint8_t *data, uint8_t len) {
    uint16_t code = 0xA5A5;
    uint8_t i;

    for (i = 0; i < len; i++) {
        code ^= (uint16_t)data[i] + 0x9B;
        code = (uint16_t)((code << 7) | (code >> 9));
        code += (uint16_t)(data[i] ^ (code >> 8));
    }

    code ^= 0x5A5A;
    return code;
}

static void seed_random_generator(void) {
    uint16_t seed;

    seed = ((uint16_t)TIM2->CNTRH << 8) | (uint16_t)TIM2->CNTRL;
    seed ^= ((uint16_t)TIM4->CNTR << 8);
    seed ^= ((uint16_t)Time_1ms << 4);
    seed ^= ((uint16_t)LL_w << 1);
    seed ^= (uint16_t)BitCount;

    if (seed == 0u) {
        seed = 0x1234u;
    }

    srand((unsigned int)seed);
}

static uint16_t generate_valid_rolling_counter(uint8_t wake_hi, uint8_t wake_lo) {
    uint16_t wake_code = ((uint16_t)wake_hi << 8) | (uint16_t)wake_lo;
    uint16_t candidate;

    do {
        candidate = (uint16_t)(((uint16_t)(rand() & 0x00FFu) << 8) |
                               (uint16_t)(rand() & 0x00FFu));
    } while ((candidate == 0x0000u) || (candidate == wake_code));

    return candidate;
}

static void xtea_encrypt_host(uint32_t *v0, uint32_t *v1, const uint32_t *k) {
    uint8_t i;
    uint32_t sum = 0;
    uint32_t delta = 0x9E3779B9;

    for (i = 0; i < 32; i++) {
        *v0 += (((*v1 << 4) ^ (*v1 >> 5)) + *v1) ^ (sum + k[sum & 3]);
        sum += delta;
        *v1 += (((*v0 << 4) ^ (*v0 >> 5)) + *v0) ^ (sum + k[(sum >> 11) & 3]);
    }
}

static void generate_pke_rf_packet_host(const uint8_t *secure_key8, uint16_t rolling_counter, uint8_t *output_packet) {
    uint32_t key[4];
    uint32_t data0, data1;
    uint16_t crc;

    key[0] = ((uint32_t)secure_key8[0] << 24) | ((uint32_t)secure_key8[1] << 16) |
             ((uint32_t)secure_key8[2] << 8)  | (uint32_t)secure_key8[3];
    key[1] = ((uint32_t)secure_key8[4] << 24) | ((uint32_t)secure_key8[5] << 16) | 0x5A5A;
    key[2] = 0x5A5A5A5A;
    key[3] = 0x5A5A5A5A;

    data0 = (uint32_t)rolling_counter;
    data1 = 0x12345678;

    xtea_encrypt_host(&data0, &data1, key);

    output_packet[0] = (uint8_t)(data0 >> 24);
    output_packet[1] = (uint8_t)(data0 >> 16);
    output_packet[2] = (uint8_t)(data0 >> 8);
    output_packet[3] = (uint8_t)data0;
    output_packet[4] = (uint8_t)(data1 >> 24);
    output_packet[5] = (uint8_t)(data1 >> 16);

    crc = Calculate_CRC16(output_packet, 6, 2);
    output_packet[6] = (uint8_t)(crc >> 8);
    output_packet[7] = (uint8_t)(crc & 0xFF);
}

void Simple_Crypt(uint8_t *data, uint8_t len) {
    uint8_t i;
    for (i = 0; i < len; i++) {
        // 1. encrypt XOR with  Secret_Key
        data[i] ^= Secret_Key[i % 8];

        // 2. use not to increase complexity
        data[i] = ~data[i];

     // 3. (option) prevent consecutive identical characters.
        data[i] ^= i;
    }
}

