jimliu3/stm8/main.c
/* ================= ISR ================= */

INTERRUPT_HANDLER(EXTI_PORTB_IRQHandler, 4)
{
    TJTW_PKE.power_event_flag = 1;
}

void TIM2_Init(void)
{
    TIM2_DeInit();
    TIM2_TimeBaseInit(TIM2_PRESCALER_16,100);   /* 0.1ms */
    TIM2_ITConfig(TIM2_IT_UPDATE , ENABLE);
    TIM2_OC2Init(TIM2_OCMODE_PWM1, TIM2_OUTPUTSTATE_ENABLE, 0, TIM2_OCPOLARITY_HIGH);
    TIM2_OC2PreloadConfig(ENABLE);
    TIM2_SetCounter(0x0000);
    TIM2_Cmd(ENABLE);
		/* TIM2 IRQ13 highest priority (level 0) */
		ITC->ISPR4 &= (uint8_t)(~0x0C);
}


void RF_Remote(uint8_t level)
{
    unsigned char i;
    const char hex_chars[] = "0123456789ABCDEF";
    char hex_out[4];
    uint16_t received_crc, calculated_crc, final_crc;
    disableInterrupts();
    RF_set = 0;
    for (i = 0; i < 8; i++) {
        RF_UartSend[i] = Buff_B[i];
    }
    received_crc = ((uint16_t)RF_UartSend[6] << 8) | (uint16_t)RF_UartSend[7];
    calculated_crc = Calculate_CRC16(RF_UartSend, 6,level);

    RFFull = 0;
    if (level == 2) {
        /* POWER_ON: key should return rolling packet with CRC only. */
        if (calculated_crc == received_crc ) {
            UART2_SendString("\r\nRF Data: ", 11);
            for (i = 0; i < 8; i++) {
                uint8_t val = RF_UartSend[i];
                hex_out[0] = hex_chars[(val >> 4) & 0x0F];
                hex_out[1] = hex_chars[val & 0x0F];
                hex_out[2] = ' ';
                UART2_SendString((unsigned char*)hex_out, 3);
            }
            RF_set = 1;
        } else {
            UART2_SendString("\r\nRF Data CRC Error in POWER_ON! ", 34);
        }
    } else if (calculated_crc == received_crc && RF_UartSend[0] == 0x54 && RF_UartSend[1] == 0x4A) {
        RF_set = 1;
        UART2_SendString("\r\nRF Data: ", 11);
        for (i = 0; i < 8; i++) {
            uint8_t val = RF_UartSend[i];
            hex_out[0] = hex_chars[(val >> 4) & 0x0F];
            hex_out[1] = hex_chars[val & 0x0F];
            hex_out[2] = ' ';
            UART2_SendString((unsigned char*)hex_out, 3);
        }
        if(level ==1) {
            calculated_crc = Generate_Wakeup_Code(RF_UartSend, 8);
            RF_UartSend[8] = (uint8_t)(calculated_crc >> 8);   // wake-up code high
            RF_UartSend[9] = (uint8_t)(calculated_crc & 0xFF); // wake-up code low
            memcpy(secure_key, RF_UartSend, 6);
            Simple_Crypt(secure_key, 6);
            final_crc = Calculate_CRC16(secure_key, 6, 2);
            secure_key[6] = (uint8_t)(final_crc >> 8);
            secure_key[7] = (uint8_t)(final_crc & 0xFF);
            secure_key[8] = (uint8_t)(calculated_crc >> 8);   // wake-up code high
            secure_key[9] = (uint8_t)(calculated_crc & 0xFF); // wake-up code low

        }

    } else {
        if (calculated_crc != received_crc) {
            UART2_SendString("\r\nRF Data CRC Error! ", 22);
        } else {
            UART2_SendString("\r\nRF Data Header Error! ", 23);
        }
    }
    enableInterrupts();
    UART2_SendString("\r\n", 2);
}


@far @interrupt void tim2_irqhandler(void)
{
    /* Clear TIM2 update interrupt flag */
    TIM2_ClearITPendingBit(TIM2_IT_UPDATE);

    /* -------------------------------------------------------------
     * Time base: 1 ms tick and 10 ms tick
     * ------------------------------------------------------------- */
    Time_1ms++;

    if (Time_1ms >= 10)
    {
        Time_1ms = 0;

        /* LF send timer countdown (clamp to 0) */
        if ((LF_ENABLE == 1) && (LF_Send_Tim > 0))
            LF_Send_Tim--;
        else
            LF_Send_Tim = 0;
    }

    /* If an RF frame is already captured, skip decoding */
    if (RFFull)
        return;

    /* -------------------------------------------------------------
     * RF OOK decoding:
     * - Measure LOW pulse width (LL_w) while RF_DATA is low
     * - On rising edge (LOW -> HIGH), interpret the LOW width
     * ------------------------------------------------------------- */
    if (RF_DATA_LOW())
    {
        /* Accumulate LOW width in ticks */
        LL_w++;
        RFBit = 0;   /* Mark current level as LOW */
    }
    else
    {
        /* Rising edge: process the LOW width that just ended */
        if (!RFBit)
        {
            if (!First_flag)
            {
                /* Detect sync/preamble LOW width */
               // if ((LL_w > 40) && (LL_w < 60))
							 if ((LL_w >= 35) && (LL_w <= 65)) // Relax the detection range of the sync header.
                {
                    First_flag = 1;
                    BitCount   = 0;
                    Buff_B[0] = Buff_B[1] = Buff_B[2] = 0;
                    Buff_B[3] = Buff_B[4] = Buff_B[5] = 0;
                    Buff_B[6] = Buff_B[7] = 0;
                }
            }
            else
            {
                /* Decode data bits by LOW width */
                //if ((LL_w > 3) && (LL_w <= 7))
								if ((LL_w >= 2) && (LL_w <= 7))  // Relax the lower limit of Bit 1 to 2 (enhance weak signal detection).
                {
                    /* Bit '1' */
                    if (BitCount < RF_LEN)
                    {
                        Buff_B[BitCount >> 3] <<= 1;
                        Buff_B[BitCount >> 3] |= 0x01;
                        BitCount++;
                    }
                }
                //else if ((LL_w >= 8) && (LL_w < 13))
								else if ((LL_w >= 8) && (LL_w <= 15)) // Relax the upper limit of Bit 0 to 15 (tolerate noise-extended waveforms)
                {
                    /* Bit '0' */
                    if (BitCount < RF_LEN)
                    {
                        Buff_B[BitCount >> 3] <<= 1;
                        BitCount++;
                    }
                }
                else
                {
                    /* Invalid width: reset decoder state */
                    First_flag = 0;
                    BitCount   = 0;
                }

                /* Frame complete */
                if (BitCount >= RF_LEN)
                {
                    BitCount   = 0;
                    First_flag = 0;
                    RFFull     = 1;
                }
            }

