jimliu3/stm8/main.c
            /* Reset LOW width counter after processing */
            LL_w = 0;
        }

        RFBit = 1;   /* Mark current level as HIGH */
    }
}

void Handle_State_Wait(uint8_t *ign_wait)
{
    UART2_SendStr("PKE_OPER_STA_WAIT in!");

    /* Check if Power Key is pressed; if so, immediately shut down to POWER_OFF */
    if (TJTW_PKE.power_event_flag) {
        TJTW_PKE.power_event_flag = 0;             // Clear power key trigger flag
        motor_turn_off();                           // Execute motor locking
        BR_LIGHT_OFF();                             // Turn off the light
        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF; // Transition to POWER_OFF state
        *ign_wait = 0;                                  // Exit WAIT state
        return;
    }

    if (IGN_IS_ON()) {
        /* Ignition ON: transition to IDLE */
        TJTW_PKE.oper_state = PKE_OPER_STA_IDLE;
        *ign_wait = 0;
        UART2_SendStr("IGN_ON PKE_OPER_STA_WAIT out!");
    } else {
        Delay_ms(1000);
        (*ign_wait)++;

        if (*ign_wait >= IGN_TIMEOUT_S) {
            /* Timeout reached: return to POWER_OFF immediately on the 10th second */
            TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
            *ign_wait = 0;
            motor_turn_off();
            UART2_SendStr("PKE_OPER_STA_WAIT out!");
        }
    }
}


void Handle_State_Idle(int *idle)
{
    if (*idle == 0) {
        UART2_SendStr("PKE_OPER_STA_IDLE in!");
        *idle = 1;
        TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
    }

    /* Blue light indicator */
    BR_LIGHT_ON();

    /* Power Key press in IDLE state; clear flag only */
    if (TJTW_PKE.power_event_flag) {
        TJTW_PKE.power_event_flag = 0; // Clear flag without executing motor_turn_off() or state transition
        UART2_SendStr("Power Key pressed during IDLE, ignored!");
    } 
    
    /* Transition to POWER_OFF only when ignition switch (IGN) is manually turned OFF */
    if (!IGN_IS_ON()) {
        /* Ignition OFF event */
        motor_turn_off();
        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
        TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
        BR_LIGHT_OFF();
        UART2_SendStr("IGN_OFF PKE_OPER_STA_IDLE out!");
        *idle = 0;
    }
}

void Handle_State_Learn(void)
{
    int i;
    int ret = 0;
    uint8_t rfid_set = 0;
    unsigned char rc522_SN[4];

    UART2_SendStr("PKE_OPER_STA_LEARN in!");
    TIM2_Init();
    TIM2_CCxCmd(TIM2_CHANNEL_2, DISABLE);
    GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_LOW_FAST);
    enableInterrupts();

    /* Attempt to read RFID card for 25 iterations */
    for (i = 0; i < 25; i++) {
        LP_RIGHT_ON();  /* Red light */
        BR_LIGHT_ON();  /* Blue light */
        Delay_ms(100);
        showcard(Tx_Buffer, &rfid_set, rc522_SN);
        Reset_RC522();
        if (rfid_set == 1) {
            UART2_SendString(Tx_Buffer, 17);
            i = 50;  /* Exit loop */
        }
        LP_RIGHT_OFF();
        BR_LIGHT_OFF();
        Delay_ms(100);
    }

    if (rfid_set == 1) {
        /* RFID card detected, now learn 433M key */
        UART2_SendStr("433m key learned!");
        i = 0;
        while (i < 16) {
            BR_LIGHT_ON();  /* Blue light */
            LF_SendData(0xc3, 0x3a, PATTREN_BIT, LF_SEND_CH1, 0x01, 0x01);
            Delay_ms(100);
            BR_LIGHT_OFF();
            Delay_ms(150);
            if (RFFull) {
                RF_Remote(1);
                UART2_SendStr("Get 433m key!");
                BR_LIGHT_OFF();
                break;
            }
            i++;
        }

        if (RF_set == 1) {
            /* Both RFID and 433M keys received, save combined key */
            LF_SendData(0xc3, 0x3a, PATTREN_BIT, LF_SEND_CH1, RF_UartSend[8], RF_UartSend[9]);
            ret = Save_Combined_Key(rc522_SN, secure_key);
            if (ret > 0) {
                UART2_SendStr("Add 2 keys to eeprom failed!");
                LP_RIGHT_ON();
                Delay_ms(500);
                LP_RIGHT_OFF();
            } else {
                UART2_SendStr("Add 2 keys to eeprom!");
                Load_Keys_To_Cache();
            }
        } else {
            /* 433M key not received */
            UART2_SendStr("433m key not learned!");
            LP_RIGHT_ON();
            Delay_ms(500);
            LP_RIGHT_OFF();
        }
    } else {
        /* RFID card not detected */
        UART2_SendStr("RFID key not learned!");
        LP_RIGHT_ON();
        Delay_ms(500);
        LP_RIGHT_OFF();
    }

    RF_set = 0;
    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
    UART2_SendStr("PKE_OPER_STA_LEARN out!");
}

void Handle_State_Power_On(void)
{
    int i;
    int ret = 0;
    int wait_count = 0;
    uint8_t rolling_hi;
    uint8_t rolling_lo;
    uint16_t rolling_counter;
    uint8_t rfid_set = 0;
    unsigned char rc522_SN[4];

    UART2_SendStr("PKE_OPER_STA_POWER_ON in!");
    enableInterrupts();

    /* Step 1: Check RFID key (3 attempts) */
    UART2_SendStr("check RFID key!");
    for (i = 0; i < 3; i++) {
        Delay_ms(100);
        showcard(Tx_Buffer, &rfid_set, rc522_SN);
        Reset_RC522();
        if (rfid_set == 1) {
            UART2_SendString(Tx_Buffer, 17);
            rfid_set = 0;
            i = 50;  /* Exit loop */
            ret = Check_Combined_RFID(rc522_SN);
        }
    }

    /* Step 2: If RFID not matched, check 433M key */
    if (ret == 0) {
        UART2_SendStr("Check 433m key!");
        i = 0;
        wait_count = 0;

        while (i < cached_key_count) {
            while (wait_count < 6) {
                disableInterrupts();
                RF_set = 0;
                RFFull = 0;
                First_flag = 0;
                BitCount = 0;
                memset(Buff_B, 0, sizeof(Buff_B));
                enableInterrupts();

                rolling_counter = generate_valid_rolling_counter(cached_keys[i][12], cached_keys[i][13]);
                rolling_hi = (uint8_t)(rolling_counter >> 8);
                rolling_lo = (uint8_t)(rolling_counter & 0xFF);

                /* Send LF command with wakeup code from cached key */
                LF_SendData(cached_keys[i][12], cached_keys[i][13], PATTREN_BIT, LF_SEND_CH1, rolling_hi, rolling_lo);

                /* Wait for RF response (max 350ms) */
                {
                    uint8_t delay_loop;
                    for (delay_loop = 0; delay_loop < 160; delay_loop++) {
                        Delay_ms(2);
                        if (RFFull) {
                            disableInterrupts();
                            break;
                        }
                    }
                }

