jimliu3/stm8/main.c
                /* Validate received RF data */
                if (RFFull) {
                    RF_Remote(2);
                    if (RF_set && Check_Combined_433M_Cached((uint8_t)i, RF_UartSend, rolling_counter)) {
                        UART2_SendStr("433m key matched!");
                        ret = 1;
                        wait_count = 10;  /* Exit inner loop */
                        break;
                    } else {
                        if (RF_set) {
                            UART2_SendStr("433m rolling packet mismatch, retry...");
                        } else {
                            UART2_SendStr("433m RF CRC error, retry...");
                        }
                        RFFull = 0;
                    }
                }
                wait_count++;
            }

            if (ret == 1) {
                break;  /* Exit outer loop */
            }
            wait_count = 0;
            i++;
        }
        enableInterrupts();
    }

    /* Step 3: Execute action based on validation result */
    if (ret == 1) {
        /* Key validation successful: unlock motor and transition to WAIT */
        motor_turn_on();
        TJTW_PKE.oper_state = PKE_OPER_STA_WAIT;
    } else {
        /* Key validation failed: flash red light and return to POWER_OFF */
        LP_RIGHT_ON();
        TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
        Delay_ms(500);
        LP_RIGHT_OFF();
    }

    UART2_SendStr("PKE_OPER_STA_POWER_ON out!");
}
void Handle_State_Power_Off(void)
{
    UART2_SendStr("PKE_OPER_STA_POWER_OFF in!");
    enableInterrupts();

    /* Stop motor and prepare for halt */
    MOTOR_STOP();
    Delay_ms(50);
    motor_turn_off();
    halt();
    Delay_ms(50);

    /* Reinitialize peripherals after wake-up */
    Clock_Config();
    GPIO_Config();
    TIM4_Init();
    Uart_Init();
    InitRc522();
    Delay_ms(50);

    /* Check wake-up source and set next state */
    if (TJTW_PKE.power_event_flag) {
        TJTW_PKE.power_event_flag = 0;
        Load_Keys_To_Cache();

        if (GPIO_ReadInputPin(GPIOA, GPIO_PIN_2)) {
            /* LEARN key pressed: enter LEARN mode */
            TJTW_PKE.oper_state = PKE_OPER_STA_LEARN;
        } else {
            /* Normal power-on: enter POWER_ON mode */
            TJTW_PKE.oper_state = PKE_OPER_STA_POWER_ON;
        }
    }

    Uart_Init();
    UART2_SendStr("PKE_OPER_STA_POWER_OFF out!");
}

#if TEST_MODE_RFID
void Poll_RFID(void)
{
    uint8_t rfid_set = 0;
    unsigned char rc522_SN[4];
    const char hex_chars[] = "0123456789ABCDEF";
    char hex_out[4];
    uint8_t i;

    showcard(Tx_Buffer, &rfid_set, rc522_SN);
    Reset_RC522();

    if (rfid_set == 1) {
        UART2_SendString("\nRFID UID: ", 12);
        for (i = 0; i < 4; i++) {
            hex_out[0] = hex_chars[(rc522_SN[i] >> 4) & 0x0F];
            hex_out[1] = hex_chars[rc522_SN[i] & 0x0F];
            hex_out[2] = ' ';
            UART2_SendString((unsigned char*)hex_out, 3);
        }
        UART2_SendString("\t", 2);
    }

    Delay_ms(200);
}
#endif

#if TEST_MODE_LF
void Test_LF_Simple(void)
{
    LF_SendData(0xc3, 0x3a, PATTREN_BIT, LF_SEND_CH1, 0x01, 0x01);
    Delay_ms(500);
}
#endif

#if TEST_MODE_RF433
void Test_RF433_Simple(void)
{

    if (RFFull)
    {
        BZ_ON();
        Delay_ms(50);
        BZ_OFF();

        disableInterrupts();
        RFFull = 0;
        First_flag = 0;
        BitCount = 0;
        memset(Buff_B, 0, sizeof(Buff_B));
        enableInterrupts();
    }
}
#endif

void main()
{
    int idle;
    uint8_t cfg_idx;
    uint8_t ign_wait = 0;

    TJTW_PKE.oper_state = PKE_OPER_STA_POWER_OFF;
    TJTW_PKE.power_event_flag = 0;
    TJTW_PKE.learn_event_flag = 0;
    idle=0;

    Clock_Config();
    GPIO_Config();
    EXTI_Config();
    TIM4_DeInit();
    TIM4_Init();
	//MX_TIM4_Init();
    Uart_Init();
    InitRc522();
    Delay_ms(100);
    //TIM2_PWM_Config();
    //Clear_PKE_EEPROM();

    LF_ClockOccurs(125);
    for (cfg_idx = 0; cfg_idx < MCU_REG_NUM; cfg_idx++) {
        Set_Buff[cfg_idx] = mcu_user_config[cfg_idx];
    }
    LF_PLL_SET(LF_PLL);

    Delay_InIt(16);
    TIM2_Init();   //need ro mask  TIM2_PWM_Config()
    enableInterrupts();
    seed_random_generator();
    /* Load all keys to RAM cache before entering main loop */
    Load_Keys_To_Cache();
		
    UART2_SendStr("system start!");
		
    while(1)
    {
        
#if TEST_MODE_RFID
        Poll_RFID();
        #endif

#if TEST_MODE_LF
        Test_LF_Simple();
        #endif

#if TEST_MODE_RF433
        Test_RF433_Simple(); 
#endif

    }
}
